Autodesk.Revit.DB.Structure.AreaReinforcement.GetCurveElementIds
Retrieves the set of curves forming the boundary of the Area Reinforcement.
Remarks:
Each ElementId in the collection is an Id of an Element of type AreaReinforcementCurve. Each element has a Curve property
to retrieve the geometric curve, together with some Parameters allowing the developer to override the clear cover side,
hook type, and hook direction of each layer of bars terminating at the curve.
Returns:
A collection of ElementIds of AreaReinforcementCurve elements.

Autodesk.Revit.DB.Structure.AreaReinforcement.RemoveAreaReinforcementSystem(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.AreaReinforcement)
Deletes the specified AreaReinforcement, and converts its RebarInSystem
elements to equivalent Rebar elements.
doc:
The document.
system:
An AreaReinforcement element in the document.
Returns:
The ids of the newly created Rebar elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document doc does not contain the element system
-or-
system does not host Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.AreaReinforcement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new AreaReinforcement object based on a host boundary.
document:
The document.
hostElement:
The element that will host the AreaReinforcement. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
majorDirection:
A vector to define the major direction of the AreaReinforcement.
areaReinforcementTypeId:
The id of the AreaReinforcementType.
rebarBarTypeId:
The id of the RebarBarType.
rebarHookTypeId:
The id of the RebarHookType.
If this parameter is InvalidElementId, it means to create a rebar with no hooks.
Returns:
The newly created AreaReinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document document does not contain the element hostElement
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
areaReinforcementTypeId should refer to an AreaReinforcementType element.
-or-
rebarBarTypeId should refer to an RebarBarType element.
-or-
rebarHookTypeId should be invalid or refer to an RebarHookType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
majorDirection has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2015

Autodesk.Revit.DB.Structure.AreaReinforcement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,System.Collections.Generic.IList`1{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new AreaReinforcement object from an array of curves.
This method replaces the NewAreaReinforcement method, which has been deprecated.
document:
The document.
hostElement:
The element that will host the AreaReinforcement. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
curveArray:
An array of curves that will define the outline of the AreaReinforcement.
majorDirection:
A vector to define the major direction of the AreaReinforcement.
areaReinforcementTypeId:
The id of the AreaReinforcementType.
rebarBarTypeId:
The id of the RebarBarType.
rebarHookTypeId:
The id of the RebarHookType.
If this parameter is InvalidElementId, it means to create a rebar with no hooks.
Returns:
The newly created AreaReinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curveArray is empty.
-or-
The input curveArray contains at least one helical curve and is not supported for this operation.
-or-
The document document does not contain the element hostElement
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
Curves in curveArray are not closed and continuous.
-or-
areaReinforcementTypeId should refer to an AreaReinforcementType element.
-or-
rebarBarTypeId should refer to an RebarBarType element.
-or-
rebarHookTypeId should be invalid or refer to an RebarHookType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
majorDirection has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2015

Autodesk.Revit.DB.Structure.AreaReinforcement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,System.Collections.Generic.IList`1{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.XYZ)
Creates a new AreaReinforcement object from an array of curves.
document:
The document.
hostElement:
The element that will host the AreaReinforcement. The host can be either a Structural Floor or Structural Wall.
curveArray:
An array of curves that will define the outline of the AreaReinforcement.
majorDirection:
A vector to define the major direction of the AreaReinforcement.
Returns:
The newly created AreaReinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curveArray is empty.
-or-
The input curveArray contains at least one helical curve and is not supported for this operation.
-or-
The document document does not contain the element hostElement
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
Curves in curveArray are not closed and continuous.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
majorDirection has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2014